Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetUserProperty Method (String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetUserProperty(
	string Name,
	ref int Value
)
Public Function GetUserProperty (
	Name As String,
	ByRef Value As Integer
) As Boolean
Parameters
Name
Type: System.String
The name of the property to be gotten.
Value
Type: System.Int32
The value of the property.
Return Value
Type: Boolean
True if the property was gotten successfully.
See Also
Reference
DatabaseObject Class
GetUserProperty Overload
Tekla.Structures.Drawing Namespace